thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_aux_evctl.h
/******************************************************************************
 *  Filename:       hw_aux_evctl_h
 *  Revised:        2017-05-16 19:35:21 +0200 (Tue, 16 May 2017)
 *  Revision:       49005
 *
 * Copyright (c) 2015 - 2017, Texas Instruments Incorporated
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without
 * modification, are permitted provided that the following conditions are met:
 *
 * 1) Redistributions of source code must retain the above copyright notice,
 *    this list of conditions and the following disclaimer.
 *
 * 2) Redistributions in binary form must reproduce the above copyright notice,
 *    this list of conditions and the following disclaimer in the documentation
 *    and/or other materials provided with the distribution.
 *
 * 3) Neither the name of the ORGANIZATION nor the names of its contributors may
 *    be used to endorse or promote products derived from this software without
 *    specific prior written permission.
 *
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
 * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
 * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE
 * ARE DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE
 * LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR
 * CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF
 * SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS
 * INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN
 * CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE)
 * ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE
 * POSSIBILITY OF SUCH DAMAGE.
 *
 ******************************************************************************/

#ifndef __HW_AUX_EVCTL_H__
#define __HW_AUX_EVCTL_H__

//*****************************************************************************
//
// This section defines the register offsets of
// AUX_EVCTL component
//
//*****************************************************************************
// Vector Configuration 0
#define AUX_EVCTL_O_VECCFG0 0x00000000

// Vector Configuration 1
#define AUX_EVCTL_O_VECCFG1 0x00000004

// Sensor Controller Engine Wait Event Selection
#define AUX_EVCTL_O_SCEWEVSEL 0x00000008

// Events To AON Flags
#define AUX_EVCTL_O_EVTOAONFLAGS 0x0000000C

// Events To AON Polarity
#define AUX_EVCTL_O_EVTOAONPOL 0x00000010

// Direct Memory Access Control
#define AUX_EVCTL_O_DMACTL 0x00000014

// Software Event Set
#define AUX_EVCTL_O_SWEVSET 0x00000018

// Event Status 0
#define AUX_EVCTL_O_EVSTAT0 0x0000001C

// Event Status 1
#define AUX_EVCTL_O_EVSTAT1 0x00000020

// Event To MCU Polarity
#define AUX_EVCTL_O_EVTOMCUPOL 0x00000024

// Events to MCU Flags
#define AUX_EVCTL_O_EVTOMCUFLAGS 0x00000028

// Combined Event To MCU Mask
#define AUX_EVCTL_O_COMBEVTOMCUMASK 0x0000002C

// Vector Flags
#define AUX_EVCTL_O_VECFLAGS 0x00000034

// Events To MCU Flags Clear
#define AUX_EVCTL_O_EVTOMCUFLAGSCLR 0x00000038

// Events To AON Clear
#define AUX_EVCTL_O_EVTOAONFLAGSCLR 0x0000003C

// Vector Flags Clear
#define AUX_EVCTL_O_VECFLAGSCLR 0x00000040

//*****************************************************************************
//
// Register: AUX_EVCTL_O_VECCFG0
//
//*****************************************************************************
// Field:    [14] VEC1_POL
//
// Vector 1 trigger event polarity.
//
// To manually trigger vector 1 execution:
// - AUX_SCE must sleep.
// - Set VEC1_EV to a known static value.
// - Toggle VEC1_POL twice.
// ENUMs:
// FALL                     Falling edge triggers vector 1 execution.
// RISE                     Rising edge triggers vector 1 execution.
#define AUX_EVCTL_VECCFG0_VEC1_POL 0x00004000
#define AUX_EVCTL_VECCFG0_VEC1_POL_BITN 14
#define AUX_EVCTL_VECCFG0_VEC1_POL_M 0x00004000
#define AUX_EVCTL_VECCFG0_VEC1_POL_S 14
#define AUX_EVCTL_VECCFG0_VEC1_POL_FALL 0x00004000
#define AUX_EVCTL_VECCFG0_VEC1_POL_RISE 0x00000000

// Field:    [13] VEC1_EN
//
// Vector 1 trigger enable.
//
// When enabled, VEC1_EV event with VEC1_POL polarity triggers a jump to vector
// # 1 when AUX_SCE sleeps.
//
// Lower vectors (0) have priority.
// ENUMs:
// EN                       Enable vector 1 trigger.
// DIS                      Disable vector 1 trigger.
#define AUX_EVCTL_VECCFG0_VEC1_EN 0x00002000
#define AUX_EVCTL_VECCFG0_VEC1_EN_BITN 13
#define AUX_EVCTL_VECCFG0_VEC1_EN_M 0x00002000
#define AUX_EVCTL_VECCFG0_VEC1_EN_S 13
#define AUX_EVCTL_VECCFG0_VEC1_EN_EN 0x00002000
#define AUX_EVCTL_VECCFG0_VEC1_EN_DIS 0x00000000

// Field:  [12:8] VEC1_EV
//
// Select vector 1 trigger source event.
// ENUMs:
// ADC_IRQ                  EVSTAT1.ADC_IRQ
// MCU_EV                   EVSTAT1.MCU_EV
// ACLK_REF                 EVSTAT1.ACLK_REF
// AUXIO15                  EVSTAT1.AUXIO15
// AUXIO14                  EVSTAT1.AUXIO14
// AUXIO13                  EVSTAT1.AUXIO13
// AUXIO12                  EVSTAT1.AUXIO12
// AUXIO11                  EVSTAT1.AUXIO11
// AUXIO10                  EVSTAT1.AUXIO10
// AUXIO9                   EVSTAT1.AUXIO9
// AUXIO8                   EVSTAT1.AUXIO8
// AUXIO7                   EVSTAT1.AUXIO7
// AUXIO6                   EVSTAT1.AUXIO6
// AUXIO5                   EVSTAT1.AUXIO5
// AUXIO4                   EVSTAT1.AUXIO4
// AUXIO3                   EVSTAT1.AUXIO3
// AUXIO2                   EVSTAT0.AUXIO2
// AUXIO1                   EVSTAT0.AUXIO1
// AUXIO0                   EVSTAT0.AUXIO0
// AON_PROG_WU              EVSTAT0.AON_PROG_WU
// AON_SW                   EVSTAT0.AON_SW
// OBSMUX1                  EVSTAT0.OBSMUX1
// OBSMUX0                  EVSTAT0.OBSMUX0
// ADC_FIFO_ALMOST_FULL     EVSTAT0.ADC_FIFO_ALMOST_FULL
// ADC_DONE                 EVSTAT0.ADC_DONE
// SMPH_AUTOTAKE_DONE       EVSTAT0.SMPH_AUTOTAKE_DONE
// TIMER1_EV                EVSTAT0.TIMER1_EV
// TIMER0_EV                EVSTAT0.TIMER0_EV
// TDC_DONE                 EVSTAT0.TDC_DONE
// AUX_COMPB                EVSTAT0.AUX_COMPB
// AUX_COMPA                EVSTAT0.AUX_COMPA
// AON_RTC_CH2              EVSTAT0.AON_RTC_CH2
#define AUX_EVCTL_VECCFG0_VEC1_EV_W 5
#define AUX_EVCTL_VECCFG0_VEC1_EV_M 0x00001F00
#define AUX_EVCTL_VECCFG0_VEC1_EV_S 8
#define AUX_EVCTL_VECCFG0_VEC1_EV_ADC_IRQ 0x00001F00
#define AUX_EVCTL_VECCFG0_VEC1_EV_MCU_EV 0x00001E00
#define AUX_EVCTL_VECCFG0_VEC1_EV_ACLK_REF 0x00001D00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO15 0x00001C00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO14 0x00001B00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO13 0x00001A00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO12 0x00001900
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO11 0x00001800
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO10 0x00001700
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO9 0x00001600
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO8 0x00001500
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO7 0x00001400
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO6 0x00001300
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO5 0x00001200
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO4 0x00001100
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO3 0x00001000
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO2 0x00000F00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO1 0x00000E00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUXIO0 0x00000D00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AON_PROG_WU 0x00000C00
#define AUX_EVCTL_VECCFG0_VEC1_EV_AON_SW 0x00000B00
#define AUX_EVCTL_VECCFG0_VEC1_EV_OBSMUX1 0x00000A00
#define AUX_EVCTL_VECCFG0_VEC1_EV_OBSMUX0 0x00000900
#define AUX_EVCTL_VECCFG0_VEC1_EV_ADC_FIFO_ALMOST_FULL 0x00000800
#define AUX_EVCTL_VECCFG0_VEC1_EV_ADC_DONE 0x00000700
#define AUX_EVCTL_VECCFG0_VEC1_EV_SMPH_AUTOTAKE_DONE 0x00000600
#define AUX_EVCTL_VECCFG0_VEC1_EV_TIMER1_EV 0x00000500
#define AUX_EVCTL_VECCFG0_VEC1_EV_TIMER0_EV 0x00000400
#define AUX_EVCTL_VECCFG0_VEC1_EV_TDC_DONE 0x00000300
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUX_COMPB 0x00000200
#define AUX_EVCTL_VECCFG0_VEC1_EV_AUX_COMPA 0x00000100
#define AUX_EVCTL_VECCFG0_VEC1_EV_AON_RTC_CH2 0x00000000

// Field:     [6] VEC0_POL
//
// Vector 0 trigger event polarity.
//
// To manually trigger vector 0 execution:
// - AUX_SCE must sleep.
// - Set VEC0_EV to a known static value.
// - Toggle VEC0_POL twice.
// ENUMs:
// FALL                     Falling edge triggers vector 0 execution.
// RISE                     Rising edge triggers vector 0 execution.
#define AUX_EVCTL_VECCFG0_VEC0_POL 0x00000040
#define AUX_EVCTL_VECCFG0_VEC0_POL_BITN 6
#define AUX_EVCTL_VECCFG0_VEC0_POL_M 0x00000040
#define AUX_EVCTL_VECCFG0_VEC0_POL_S 6
#define AUX_EVCTL_VECCFG0_VEC0_POL_FALL 0x00000040
#define AUX_EVCTL_VECCFG0_VEC0_POL_RISE 0x00000000

// Field:     [5] VEC0_EN
//
// Vector 0 trigger enable.
//
// When enabled, VEC0_EV event with VEC0_POL polarity triggers a jump to vector
// # 0 when AUX_SCE sleeps.
// ENUMs:
// EN                       Enable vector 0 trigger.
// DIS                      Disable vector 0 trigger.
#define AUX_EVCTL_VECCFG0_VEC0_EN 0x00000020
#define AUX_EVCTL_VECCFG0_VEC0_EN_BITN 5
#define AUX_EVCTL_VECCFG0_VEC0_EN_M 0x00000020
#define AUX_EVCTL_VECCFG0_VEC0_EN_S 5
#define AUX_EVCTL_VECCFG0_VEC0_EN_EN 0x00000020
#define AUX_EVCTL_VECCFG0_VEC0_EN_DIS 0x00000000

// Field:   [4:0] VEC0_EV
//
// Select vector 0 trigger source event.
// ENUMs:
// ADC_IRQ                  EVSTAT1.ADC_IRQ
// MCU_EV                   EVSTAT1.MCU_EV
// ACLK_REF                 EVSTAT1.ACLK_REF
// AUXIO15                  EVSTAT1.AUXIO15
// AUXIO14                  EVSTAT1.AUXIO14
// AUXIO13                  EVSTAT1.AUXIO13
// AUXIO12                  EVSTAT1.AUXIO12
// AUXIO11                  EVSTAT1.AUXIO11
// AUXIO10                  EVSTAT1.AUXIO10
// AUXIO9                   EVSTAT1.AUXIO9
// AUXIO8                   EVSTAT1.AUXIO8
// AUXIO7                   EVSTAT1.AUXIO7
// AUXIO6                   EVSTAT1.AUXIO6
// AUXIO5                   EVSTAT1.AUXIO5
// AUXIO4                   EVSTAT1.AUXIO4
// AUXIO3                   EVSTAT1.AUXIO3
// AUXIO2                   EVSTAT0.AUXIO2
// AUXIO1                   EVSTAT0.AUXIO1
// AUXIO0                   EVSTAT0.AUXIO0
// AON_PROG_WU              EVSTAT0.AON_PROG_WU
// AON_SW                   EVSTAT0.AON_SW
// OBSMUX1                  EVSTAT0.OBSMUX1
// OBSMUX0                  EVSTAT0.OBSMUX0
// ADC_FIFO_ALMOST_FULL     EVSTAT0.ADC_FIFO_ALMOST_FULL
// ADC_DONE                 EVSTAT0.ADC_DONE
// SMPH_AUTOTAKE_DONE       EVSTAT0.SMPH_AUTOTAKE_DONE
// TIMER1_EV                EVSTAT0.TIMER1_EV
// TIMER0_EV                EVSTAT0.TIMER0_EV
// TDC_DONE                 EVSTAT0.TDC_DONE
// AUX_COMPB                EVSTAT0.AUX_COMPB
// AUX_COMPA                EVSTAT0.AUX_COMPA
// AON_RTC_CH2              EVSTAT0.AON_RTC_CH2
#define AUX_EVCTL_VECCFG0_VEC0_EV_W 5
#define AUX_EVCTL_VECCFG0_VEC0_EV_M 0x0000001F
#define AUX_EVCTL_VECCFG0_VEC0_EV_S 0
#define AUX_EVCTL_VECCFG0_VEC0_EV_ADC_IRQ 0x0000001F
#define AUX_EVCTL_VECCFG0_VEC0_EV_MCU_EV 0x0000001E
#define AUX_EVCTL_VECCFG0_VEC0_EV_ACLK_REF 0x0000001D
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO15 0x0000001C
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO14 0x0000001B
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO13 0x0000001A
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO12 0x00000019
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO11 0x00000018
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO10 0x00000017
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO9 0x00000016
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO8 0x00000015
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO7 0x00000014
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO6 0x00000013
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO5 0x00000012
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO4 0x00000011
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO3 0x00000010
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO2 0x0000000F
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO1 0x0000000E
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUXIO0 0x0000000D
#define AUX_EVCTL_VECCFG0_VEC0_EV_AON_PROG_WU 0x0000000C
#define AUX_EVCTL_VECCFG0_VEC0_EV_AON_SW 0x0000000B
#define AUX_EVCTL_VECCFG0_VEC0_EV_OBSMUX1 0x0000000A
#define AUX_EVCTL_VECCFG0_VEC0_EV_OBSMUX0 0x00000009
#define AUX_EVCTL_VECCFG0_VEC0_EV_ADC_FIFO_ALMOST_FULL 0x00000008
#define AUX_EVCTL_VECCFG0_VEC0_EV_ADC_DONE 0x00000007
#define AUX_EVCTL_VECCFG0_VEC0_EV_SMPH_AUTOTAKE_DONE 0x00000006
#define AUX_EVCTL_VECCFG0_VEC0_EV_TIMER1_EV 0x00000005
#define AUX_EVCTL_VECCFG0_VEC0_EV_TIMER0_EV 0x00000004
#define AUX_EVCTL_VECCFG0_VEC0_EV_TDC_DONE 0x00000003
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUX_COMPB 0x00000002
#define AUX_EVCTL_VECCFG0_VEC0_EV_AUX_COMPA 0x00000001
#define AUX_EVCTL_VECCFG0_VEC0_EV_AON_RTC_CH2 0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_VECCFG1
//
//*****************************************************************************
// Field:    [14] VEC3_POL
//
// Vector 3 trigger event polarity.
//
// To manually trigger vector 3 execution:
// - AUX_SCE must sleep.
// - Set VEC3_EV to a known static value.
// - Toggle VEC3_POL twice.
// ENUMs:
// FALL                     Falling edge triggers vector 3 execution.
// RISE                     Rising edge triggers vector 3 execution.
#define AUX_EVCTL_VECCFG1_VEC3_POL 0x00004000
#define AUX_EVCTL_VECCFG1_VEC3_POL_BITN 14
#define AUX_EVCTL_VECCFG1_VEC3_POL_M 0x00004000
#define AUX_EVCTL_VECCFG1_VEC3_POL_S 14
#define AUX_EVCTL_VECCFG1_VEC3_POL_FALL 0x00004000
#define AUX_EVCTL_VECCFG1_VEC3_POL_RISE 0x00000000

// Field:    [13] VEC3_EN
//
// Vector 3 trigger enable.
//
// When enabled, VEC3_EV event with VEC3_POL polarity triggers a jump to vector
// # 3 when AUX_SCE sleeps.
//
// Lower vectors (0, 1, and 2) have priority.
// ENUMs:
// EN                       Enable vector 3 trigger.
// DIS                      Disable vector 3 trigger.
#define AUX_EVCTL_VECCFG1_VEC3_EN 0x00002000
#define AUX_EVCTL_VECCFG1_VEC3_EN_BITN 13
#define AUX_EVCTL_VECCFG1_VEC3_EN_M 0x00002000
#define AUX_EVCTL_VECCFG1_VEC3_EN_S 13
#define AUX_EVCTL_VECCFG1_VEC3_EN_EN 0x00002000
#define AUX_EVCTL_VECCFG1_VEC3_EN_DIS 0x00000000

// Field:  [12:8] VEC3_EV
//
// Select vector 3 trigger source event.
// ENUMs:
// ADC_IRQ                  EVSTAT1.ADC_IRQ
// MCU_EV                   EVSTAT1.MCU_EV
// ACLK_REF                 EVSTAT1.ACLK_REF
// AUXIO15                  EVSTAT1.AUXIO15
// AUXIO14                  EVSTAT1.AUXIO14
// AUXIO13                  EVSTAT1.AUXIO13
// AUXIO12                  EVSTAT1.AUXIO12
// AUXIO11                  EVSTAT1.AUXIO11
// AUXIO10                  EVSTAT1.AUXIO10
// AUXIO9                   EVSTAT1.AUXIO9
// AUXIO8                   EVSTAT1.AUXIO8
// AUXIO7                   EVSTAT1.AUXIO7
// AUXIO6                   EVSTAT1.AUXIO6
// AUXIO5                   EVSTAT1.AUXIO5
// AUXIO4                   EVSTAT1.AUXIO4
// AUXIO3                   EVSTAT1.AUXIO3
// AUXIO2                   EVSTAT0.AUXIO2
// AUXIO1                   EVSTAT0.AUXIO1
// AUXIO0                   EVSTAT0.AUXIO0
// AON_PROG_WU              EVSTAT0.AON_PROG_WU
// AON_SW                   EVSTAT0.AON_SW
// OBSMUX1                  EVSTAT0.OBSMUX1
// OBSMUX0                  EVSTAT0.OBSMUX0
// ADC_FIFO_ALMOST_FULL     EVSTAT0.ADC_FIFO_ALMOST_FULL
// ADC_DONE                 EVSTAT0.ADC_DONE
// SMPH_AUTOTAKE_DONE       EVSTAT0.SMPH_AUTOTAKE_DONE
// TIMER1_EV                EVSTAT0.TIMER1_EV
// TIMER0_EV                EVSTAT0.TIMER0_EV
// TDC_DONE                 EVSTAT0.TDC_DONE
// AUX_COMPB                EVSTAT0.AUX_COMPB
// AUX_COMPA                EVSTAT0.AUX_COMPA
// AON_RTC_CH2              EVSTAT0.AON_RTC_CH2
#define AUX_EVCTL_VECCFG1_VEC3_EV_W 5
#define AUX_EVCTL_VECCFG1_VEC3_EV_M 0x00001F00
#define AUX_EVCTL_VECCFG1_VEC3_EV_S 8
#define AUX_EVCTL_VECCFG1_VEC3_EV_ADC_IRQ 0x00001F00
#define AUX_EVCTL_VECCFG1_VEC3_EV_MCU_EV 0x00001E00
#define AUX_EVCTL_VECCFG1_VEC3_EV_ACLK_REF 0x00001D00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO15 0x00001C00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO14 0x00001B00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO13 0x00001A00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO12 0x00001900
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO11 0x00001800
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO10 0x00001700
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO9 0x00001600
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO8 0x00001500
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO7 0x00001400
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO6 0x00001300
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO5 0x00001200
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO4 0x00001100
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO3 0x00001000
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO2 0x00000F00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO1 0x00000E00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUXIO0 0x00000D00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AON_PROG_WU 0x00000C00
#define AUX_EVCTL_VECCFG1_VEC3_EV_AON_SW 0x00000B00
#define AUX_EVCTL_VECCFG1_VEC3_EV_OBSMUX1 0x00000A00
#define AUX_EVCTL_VECCFG1_VEC3_EV_OBSMUX0 0x00000900
#define AUX_EVCTL_VECCFG1_VEC3_EV_ADC_FIFO_ALMOST_FULL 0x00000800
#define AUX_EVCTL_VECCFG1_VEC3_EV_ADC_DONE 0x00000700
#define AUX_EVCTL_VECCFG1_VEC3_EV_SMPH_AUTOTAKE_DONE 0x00000600
#define AUX_EVCTL_VECCFG1_VEC3_EV_TIMER1_EV 0x00000500
#define AUX_EVCTL_VECCFG1_VEC3_EV_TIMER0_EV 0x00000400
#define AUX_EVCTL_VECCFG1_VEC3_EV_TDC_DONE 0x00000300
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUX_COMPB 0x00000200
#define AUX_EVCTL_VECCFG1_VEC3_EV_AUX_COMPA 0x00000100
#define AUX_EVCTL_VECCFG1_VEC3_EV_AON_RTC_CH2 0x00000000

// Field:     [6] VEC2_POL
//
// Vector 2 trigger event polarity.
//
// To manually trigger vector 2 execution:
// - AUX_SCE must sleep.
// - Set VEC2_EV to a known static value.
// - Toggle VEC2_POL twice.
// ENUMs:
// FALL                     Falling edge triggers vector 2 execution.
// RISE                     Rising edge triggers vector 2 execution.
#define AUX_EVCTL_VECCFG1_VEC2_POL 0x00000040
#define AUX_EVCTL_VECCFG1_VEC2_POL_BITN 6
#define AUX_EVCTL_VECCFG1_VEC2_POL_M 0x00000040
#define AUX_EVCTL_VECCFG1_VEC2_POL_S 6
#define AUX_EVCTL_VECCFG1_VEC2_POL_FALL 0x00000040
#define AUX_EVCTL_VECCFG1_VEC2_POL_RISE 0x00000000

// Field:     [5] VEC2_EN
//
// Vector 2 trigger enable.
//
// When enabled, VEC2_EV event with VEC2_POL polarity triggers a jump to vector
// # 2 when AUX_SCE sleeps.
//
// Lower vectors (0 and 1) have priority.
// ENUMs:
// EN                       Enable vector 2 trigger.
// DIS                      Disable vector 2 trigger.
#define AUX_EVCTL_VECCFG1_VEC2_EN 0x00000020
#define AUX_EVCTL_VECCFG1_VEC2_EN_BITN 5
#define AUX_EVCTL_VECCFG1_VEC2_EN_M 0x00000020
#define AUX_EVCTL_VECCFG1_VEC2_EN_S 5
#define AUX_EVCTL_VECCFG1_VEC2_EN_EN 0x00000020
#define AUX_EVCTL_VECCFG1_VEC2_EN_DIS 0x00000000

