thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_aux_evctl.h
// Field:   [4:0] VEC2_EV
//
// Select vector 2 trigger source event.
// ENUMs:
// ADC_IRQ                  EVSTAT1.ADC_IRQ
// MCU_EV                   EVSTAT1.MCU_EV
// ACLK_REF                 EVSTAT1.ACLK_REF
// AUXIO15                  EVSTAT1.AUXIO15
// AUXIO14                  EVSTAT1.AUXIO14
// AUXIO13                  EVSTAT1.AUXIO13
// AUXIO12                  EVSTAT1.AUXIO12
// AUXIO11                  EVSTAT1.AUXIO11
// AUXIO10                  EVSTAT1.AUXIO10
// AUXIO9                   EVSTAT1.AUXIO9
// AUXIO8                   EVSTAT1.AUXIO8
// AUXIO7                   EVSTAT1.AUXIO7
// AUXIO6                   EVSTAT1.AUXIO6
// AUXIO5                   EVSTAT1.AUXIO5
// AUXIO4                   EVSTAT1.AUXIO4
// AUXIO3                   EVSTAT1.AUXIO3
// AUXIO2                   EVSTAT0.AUXIO2
// AUXIO1                   EVSTAT0.AUXIO1
// AUXIO0                   EVSTAT0.AUXIO0
// AON_PROG_WU              EVSTAT0.AON_PROG_WU
// AON_SW                   EVSTAT0.AON_SW
// OBSMUX1                  EVSTAT0.OBSMUX1
// OBSMUX0                  EVSTAT0.OBSMUX0
// ADC_FIFO_ALMOST_FULL     EVSTAT0.ADC_FIFO_ALMOST_FULL
// ADC_DONE                 EVSTAT0.ADC_DONE
// SMPH_AUTOTAKE_DONE       EVSTAT0.SMPH_AUTOTAKE_DONE
// TIMER1_EV                EVSTAT0.TIMER1_EV
// TIMER0_EV                EVSTAT0.TIMER0_EV
// TDC_DONE                 EVSTAT0.TDC_DONE
// AUX_COMPB                EVSTAT0.AUX_COMPB
// AUX_COMPA                EVSTAT0.AUX_COMPA
// AON_RTC_CH2              EVSTAT0.AON_RTC_CH2
#define AUX_EVCTL_VECCFG1_VEC2_EV_W 5
#define AUX_EVCTL_VECCFG1_VEC2_EV_M 0x0000001F
#define AUX_EVCTL_VECCFG1_VEC2_EV_S 0
#define AUX_EVCTL_VECCFG1_VEC2_EV_ADC_IRQ 0x0000001F
#define AUX_EVCTL_VECCFG1_VEC2_EV_MCU_EV 0x0000001E
#define AUX_EVCTL_VECCFG1_VEC2_EV_ACLK_REF 0x0000001D
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO15 0x0000001C
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO14 0x0000001B
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO13 0x0000001A
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO12 0x00000019
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO11 0x00000018
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO10 0x00000017
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO9 0x00000016
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO8 0x00000015
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO7 0x00000014
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO6 0x00000013
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO5 0x00000012
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO4 0x00000011
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO3 0x00000010
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO2 0x0000000F
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO1 0x0000000E
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUXIO0 0x0000000D
#define AUX_EVCTL_VECCFG1_VEC2_EV_AON_PROG_WU 0x0000000C
#define AUX_EVCTL_VECCFG1_VEC2_EV_AON_SW 0x0000000B
#define AUX_EVCTL_VECCFG1_VEC2_EV_OBSMUX1 0x0000000A
#define AUX_EVCTL_VECCFG1_VEC2_EV_OBSMUX0 0x00000009
#define AUX_EVCTL_VECCFG1_VEC2_EV_ADC_FIFO_ALMOST_FULL 0x00000008
#define AUX_EVCTL_VECCFG1_VEC2_EV_ADC_DONE 0x00000007
#define AUX_EVCTL_VECCFG1_VEC2_EV_SMPH_AUTOTAKE_DONE 0x00000006
#define AUX_EVCTL_VECCFG1_VEC2_EV_TIMER1_EV 0x00000005
#define AUX_EVCTL_VECCFG1_VEC2_EV_TIMER0_EV 0x00000004
#define AUX_EVCTL_VECCFG1_VEC2_EV_TDC_DONE 0x00000003
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUX_COMPB 0x00000002
#define AUX_EVCTL_VECCFG1_VEC2_EV_AUX_COMPA 0x00000001
#define AUX_EVCTL_VECCFG1_VEC2_EV_AON_RTC_CH2 0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_SCEWEVSEL
//
//*****************************************************************************
// Field:   [4:0] WEV7_EV
//
// Select event source to connect to AUX_SCE:WUSTAT.EV_SIGNALS bit 7.
// ENUMs:
// ADC_IRQ                  EVSTAT1.ADC_IRQ
// MCU_EV                   EVSTAT1.MCU_EV
// ACLK_REF                 EVSTAT1.ACLK_REF
// AUXIO15                  EVSTAT1.AUXIO15
// AUXIO14                  EVSTAT1.AUXIO14
// AUXIO13                  EVSTAT1.AUXIO13
// AUXIO12                  EVSTAT1.AUXIO12
// AUXIO11                  EVSTAT1.AUXIO11
// AUXIO10                  EVSTAT1.AUXIO10
// AUXIO9                   EVSTAT1.AUXIO9
// AUXIO8                   EVSTAT1.AUXIO8
// AUXIO7                   EVSTAT1.AUXIO7
// AUXIO6                   EVSTAT1.AUXIO6
// AUXIO5                   EVSTAT1.AUXIO5
// AUXIO4                   EVSTAT1.AUXIO4
// AUXIO3                   EVSTAT1.AUXIO3
// AUXIO2                   EVSTAT0.AUXIO2
// AUXIO1                   EVSTAT0.AUXIO1
// AUXIO0                   EVSTAT0.AUXIO0
// AON_PROG_WU              EVSTAT0.AON_PROG_WU
// AON_SW                   EVSTAT0.AON_SW
// OBSMUX1                  EVSTAT0.OBSMUX1
// OBSMUX0                  EVSTAT0.OBSMUX0
// ADC_FIFO_ALMOST_FULL     EVSTAT0.ADC_FIFO_ALMOST_FULL
// ADC_DONE                 EVSTAT0.ADC_DONE
// SMPH_AUTOTAKE_DONE       EVSTAT0.SMPH_AUTOTAKE_DONE
// TIMER1_EV                EVSTAT0.TIMER1_EV
// TIMER0_EV                EVSTAT0.TIMER0_EV
// TDC_DONE                 EVSTAT0.TDC_DONE
// AUX_COMPB                EVSTAT0.AUX_COMPB
// AUX_COMPA                EVSTAT0.AUX_COMPA
// AON_RTC_CH2              EVSTAT0.AON_RTC_CH2
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_W 5
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_M 0x0000001F
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_S 0
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_ADC_IRQ 0x0000001F
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_MCU_EV 0x0000001E
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_ACLK_REF 0x0000001D
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO15 0x0000001C
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO14 0x0000001B
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO13 0x0000001A
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO12 0x00000019
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO11 0x00000018
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO10 0x00000017
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO9 0x00000016
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO8 0x00000015
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO7 0x00000014
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO6 0x00000013
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO5 0x00000012
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO4 0x00000011
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO3 0x00000010
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO2 0x0000000F
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO1 0x0000000E
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUXIO0 0x0000000D
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AON_PROG_WU 0x0000000C
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AON_SW 0x0000000B
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_OBSMUX1 0x0000000A
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_OBSMUX0 0x00000009
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_ADC_FIFO_ALMOST_FULL 0x00000008
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_ADC_DONE 0x00000007
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_SMPH_AUTOTAKE_DONE 0x00000006
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_TIMER1_EV 0x00000005
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_TIMER0_EV 0x00000004
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_TDC_DONE 0x00000003
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUX_COMPB 0x00000002
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AUX_COMPA 0x00000001
#define AUX_EVCTL_SCEWEVSEL_WEV7_EV_AON_RTC_CH2 0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOAONFLAGS
//
//*****************************************************************************
// Field:     [8] TIMER1_EV
//
// This event flag is set when level selected by EVTOAONPOL.TIMER1_EV occurs on
// EVSTAT0.TIMER1_EV.
#define AUX_EVCTL_EVTOAONFLAGS_TIMER1_EV 0x00000100
#define AUX_EVCTL_EVTOAONFLAGS_TIMER1_EV_BITN 8
#define AUX_EVCTL_EVTOAONFLAGS_TIMER1_EV_M 0x00000100
#define AUX_EVCTL_EVTOAONFLAGS_TIMER1_EV_S 8

