thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_aux_evctl.h
// Field:     [7] TIMER0_EV
//
// This event flag is set when level selected by EVTOAONPOL.TIMER0_EV occurs on
// EVSTAT0.TIMER0_EV.
#define AUX_EVCTL_EVTOAONFLAGS_TIMER0_EV 0x00000080
#define AUX_EVCTL_EVTOAONFLAGS_TIMER0_EV_BITN 7
#define AUX_EVCTL_EVTOAONFLAGS_TIMER0_EV_M 0x00000080
#define AUX_EVCTL_EVTOAONFLAGS_TIMER0_EV_S 7

// Field:     [6] TDC_DONE
//
// This event flag is set when level selected by EVTOAONPOL.TDC_DONE occurs on
// EVSTAT0.TDC_DONE.
#define AUX_EVCTL_EVTOAONFLAGS_TDC_DONE 0x00000040
#define AUX_EVCTL_EVTOAONFLAGS_TDC_DONE_BITN 6
#define AUX_EVCTL_EVTOAONFLAGS_TDC_DONE_M 0x00000040
#define AUX_EVCTL_EVTOAONFLAGS_TDC_DONE_S 6

// Field:     [5] ADC_DONE
//
// This event flag is set when level selected by EVTOAONPOL.ADC_DONE occurs on
// EVSTAT0.ADC_DONE.
#define AUX_EVCTL_EVTOAONFLAGS_ADC_DONE 0x00000020
#define AUX_EVCTL_EVTOAONFLAGS_ADC_DONE_BITN 5
#define AUX_EVCTL_EVTOAONFLAGS_ADC_DONE_M 0x00000020
#define AUX_EVCTL_EVTOAONFLAGS_ADC_DONE_S 5

// Field:     [4] AUX_COMPB
//
// This event flag is set when edge selected by EVTOAONPOL.AUX_COMPB occurs on
// EVSTAT0.AUX_COMPB.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB 0x00000010
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB_BITN 4
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB_M 0x00000010
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPB_S 4

// Field:     [3] AUX_COMPA
//
// This event flag is set when edge selected by EVTOAONPOL.AUX_COMPA occurs on
// EVSTAT0.AUX_COMPA.
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPA 0x00000008
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPA_BITN 3
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPA_M 0x00000008
#define AUX_EVCTL_EVTOAONFLAGS_AUX_COMPA_S 3

// Field:     [2] SWEV2
//
// This event flag is set when software writes a 1 to SWEVSET.SWEV2.
#define AUX_EVCTL_EVTOAONFLAGS_SWEV2 0x00000004
#define AUX_EVCTL_EVTOAONFLAGS_SWEV2_BITN 2
#define AUX_EVCTL_EVTOAONFLAGS_SWEV2_M 0x00000004
#define AUX_EVCTL_EVTOAONFLAGS_SWEV2_S 2

// Field:     [1] SWEV1
//
// This event flag is set when software writes a 1 to SWEVSET.SWEV1.
#define AUX_EVCTL_EVTOAONFLAGS_SWEV1 0x00000002
#define AUX_EVCTL_EVTOAONFLAGS_SWEV1_BITN 1
#define AUX_EVCTL_EVTOAONFLAGS_SWEV1_M 0x00000002
#define AUX_EVCTL_EVTOAONFLAGS_SWEV1_S 1

// Field:     [0] SWEV0
//
// This event flag is set when software writes a 1 to SWEVSET.SWEV0.
#define AUX_EVCTL_EVTOAONFLAGS_SWEV0 0x00000001
#define AUX_EVCTL_EVTOAONFLAGS_SWEV0_BITN 0
#define AUX_EVCTL_EVTOAONFLAGS_SWEV0_M 0x00000001
#define AUX_EVCTL_EVTOAONFLAGS_SWEV0_S 0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOAONPOL
//
//*****************************************************************************
// Field:     [8] TIMER1_EV
//
// Select the level of EVSTAT0.TIMER1_EV that sets EVTOAONFLAGS.TIMER1_EV.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOAONPOL_TIMER1_EV 0x00000100
#define AUX_EVCTL_EVTOAONPOL_TIMER1_EV_BITN 8
#define AUX_EVCTL_EVTOAONPOL_TIMER1_EV_M 0x00000100
#define AUX_EVCTL_EVTOAONPOL_TIMER1_EV_S 8
#define AUX_EVCTL_EVTOAONPOL_TIMER1_EV_LOW 0x00000100
#define AUX_EVCTL_EVTOAONPOL_TIMER1_EV_HIGH 0x00000000

// Field:     [7] TIMER0_EV
//
// Select the level of EVSTAT0.TIMER0_EV that sets EVTOAONFLAGS.TIMER0_EV.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOAONPOL_TIMER0_EV 0x00000080
#define AUX_EVCTL_EVTOAONPOL_TIMER0_EV_BITN 7
#define AUX_EVCTL_EVTOAONPOL_TIMER0_EV_M 0x00000080
#define AUX_EVCTL_EVTOAONPOL_TIMER0_EV_S 7
#define AUX_EVCTL_EVTOAONPOL_TIMER0_EV_LOW 0x00000080
#define AUX_EVCTL_EVTOAONPOL_TIMER0_EV_HIGH 0x00000000

// Field:     [6] TDC_DONE
//
// Select level of EVSTAT0.TDC_DONE that sets EVTOAONFLAGS.TDC_DONE.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOAONPOL_TDC_DONE 0x00000040
#define AUX_EVCTL_EVTOAONPOL_TDC_DONE_BITN 6
#define AUX_EVCTL_EVTOAONPOL_TDC_DONE_M 0x00000040
#define AUX_EVCTL_EVTOAONPOL_TDC_DONE_S 6
#define AUX_EVCTL_EVTOAONPOL_TDC_DONE_LOW 0x00000040
#define AUX_EVCTL_EVTOAONPOL_TDC_DONE_HIGH 0x00000000

// Field:     [5] ADC_DONE
//
// Select the level of  EVSTAT0.ADC_DONE that sets EVTOAONFLAGS.ADC_DONE.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOAONPOL_ADC_DONE 0x00000020
#define AUX_EVCTL_EVTOAONPOL_ADC_DONE_BITN 5
#define AUX_EVCTL_EVTOAONPOL_ADC_DONE_M 0x00000020
#define AUX_EVCTL_EVTOAONPOL_ADC_DONE_S 5
#define AUX_EVCTL_EVTOAONPOL_ADC_DONE_LOW 0x00000020
#define AUX_EVCTL_EVTOAONPOL_ADC_DONE_HIGH 0x00000000

// Field:     [4] AUX_COMPB
//
// Select the edge of  EVSTAT0.AUX_COMPB that sets EVTOAONFLAGS.AUX_COMPB.
// ENUMs:
// LOW                      Falling edge
// HIGH                     Rising edge
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB 0x00000010
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_BITN 4
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_M 0x00000010
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_S 4
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_LOW 0x00000010
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPB_HIGH 0x00000000

// Field:     [3] AUX_COMPA
//
// Select the edge of  EVSTAT0.AUX_COMPA that sets EVTOAONFLAGS.AUX_COMPA.
// ENUMs:
// LOW                      Falling edge
// HIGH                     Rising edge
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA 0x00000008
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_BITN 3
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_M 0x00000008
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_S 3
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_LOW 0x00000008
#define AUX_EVCTL_EVTOAONPOL_AUX_COMPA_HIGH 0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_DMACTL
//
//*****************************************************************************
// Field:     [2] REQ_MODE
//
// UDMA0 Request mode
// ENUMs:
// SINGLE                   Single requests are generated on UDMA0 channel 7
//                          when the condition configured in SEL is met.
// BURST                    Burst requests are generated on UDMA0 channel 7
//                          when the condition configured in SEL is met.
#define AUX_EVCTL_DMACTL_REQ_MODE 0x00000004
#define AUX_EVCTL_DMACTL_REQ_MODE_BITN 2
#define AUX_EVCTL_DMACTL_REQ_MODE_M 0x00000004
#define AUX_EVCTL_DMACTL_REQ_MODE_S 2
#define AUX_EVCTL_DMACTL_REQ_MODE_SINGLE 0x00000004
#define AUX_EVCTL_DMACTL_REQ_MODE_BURST 0x00000000

// Field:     [1] EN
//
// uDMA ADC interface enable.
//
// 0: Disable UDMA0 interface to ADC.
// 1: Enable UDMA0 interface to ADC.
#define AUX_EVCTL_DMACTL_EN 0x00000002
#define AUX_EVCTL_DMACTL_EN_BITN 1
#define AUX_EVCTL_DMACTL_EN_M 0x00000002
#define AUX_EVCTL_DMACTL_EN_S 1

