thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_aux_evctl.h
// Field:     [0] SEL
//
// Select FIFO watermark level required to trigger a UDMA0 transfer of ADC FIFO
// data.
// ENUMs:
// FIFO_ALMOST_FULL         UDMA0 trigger event will be generated when the ADC
//                          FIFO is almost full (3/4 full).
// FIFO_NOT_EMPTY           UDMA0 trigger event will be generated when there
//                          are samples in the ADC FIFO.
#define AUX_EVCTL_DMACTL_SEL 0x00000001
#define AUX_EVCTL_DMACTL_SEL_BITN 0
#define AUX_EVCTL_DMACTL_SEL_M 0x00000001
#define AUX_EVCTL_DMACTL_SEL_S 0
#define AUX_EVCTL_DMACTL_SEL_FIFO_ALMOST_FULL 0x00000001
#define AUX_EVCTL_DMACTL_SEL_FIFO_NOT_EMPTY 0x00000000

//*****************************************************************************
//
// Register: AUX_EVCTL_O_SWEVSET
//
//*****************************************************************************
// Field:     [2] SWEV2
//
// Software event flag 2.
//
// 0: No effect.
// 1: Set software event flag 2.
#define AUX_EVCTL_SWEVSET_SWEV2 0x00000004
#define AUX_EVCTL_SWEVSET_SWEV2_BITN 2
#define AUX_EVCTL_SWEVSET_SWEV2_M 0x00000004
#define AUX_EVCTL_SWEVSET_SWEV2_S 2

// Field:     [1] SWEV1
//
// Software event flag 1.
//
// 0: No effect.
// 1: Set software event flag 1.
#define AUX_EVCTL_SWEVSET_SWEV1 0x00000002
#define AUX_EVCTL_SWEVSET_SWEV1_BITN 1
#define AUX_EVCTL_SWEVSET_SWEV1_M 0x00000002
#define AUX_EVCTL_SWEVSET_SWEV1_S 1

// Field:     [0] SWEV0
//
// Software event flag 0.
//
// 0: No effect.
// 1: Set software event flag 0.
#define AUX_EVCTL_SWEVSET_SWEV0 0x00000001
#define AUX_EVCTL_SWEVSET_SWEV0_BITN 0
#define AUX_EVCTL_SWEVSET_SWEV0_M 0x00000001
#define AUX_EVCTL_SWEVSET_SWEV0_S 0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVSTAT0
//
//*****************************************************************************
// Field:    [15] AUXIO2
//
// AUXIO2   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 2.
#define AUX_EVCTL_EVSTAT0_AUXIO2 0x00008000
#define AUX_EVCTL_EVSTAT0_AUXIO2_BITN 15
#define AUX_EVCTL_EVSTAT0_AUXIO2_M 0x00008000
#define AUX_EVCTL_EVSTAT0_AUXIO2_S 15

// Field:    [14] AUXIO1
//
// AUXIO1   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 1.
#define AUX_EVCTL_EVSTAT0_AUXIO1 0x00004000
#define AUX_EVCTL_EVSTAT0_AUXIO1_BITN 14
#define AUX_EVCTL_EVSTAT0_AUXIO1_M 0x00004000
#define AUX_EVCTL_EVSTAT0_AUXIO1_S 14

// Field:    [13] AUXIO0
//
// AUXIO0   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 0.
#define AUX_EVCTL_EVSTAT0_AUXIO0 0x00002000
#define AUX_EVCTL_EVSTAT0_AUXIO0_BITN 13
#define AUX_EVCTL_EVSTAT0_AUXIO0_M 0x00002000
#define AUX_EVCTL_EVSTAT0_AUXIO0_S 13

// Field:    [12] AON_PROG_WU
//
// AON_EVENT:AUXWUSEL.WU2_EV OR AON_EVENT:AUXWUSEL.WU1_EV OR
// AON_EVENT:AUXWUSEL.WU0_EV
#define AUX_EVCTL_EVSTAT0_AON_PROG_WU 0x00001000
#define AUX_EVCTL_EVSTAT0_AON_PROG_WU_BITN 12
#define AUX_EVCTL_EVSTAT0_AON_PROG_WU_M 0x00001000
#define AUX_EVCTL_EVSTAT0_AON_PROG_WU_S 12

// Field:    [11] AON_SW
//
// AON_WUC:AUXCTL.SWEV
#define AUX_EVCTL_EVSTAT0_AON_SW 0x00000800
#define AUX_EVCTL_EVSTAT0_AON_SW_BITN 11
#define AUX_EVCTL_EVSTAT0_AON_SW_M 0x00000800
#define AUX_EVCTL_EVSTAT0_AON_SW_S 11

// Field:    [10] OBSMUX1
//
// Observation input 1 from IOC.
// This event is configured by IOC:OBSAUXOUTPUT.SEL1.
#define AUX_EVCTL_EVSTAT0_OBSMUX1 0x00000400
#define AUX_EVCTL_EVSTAT0_OBSMUX1_BITN 10
#define AUX_EVCTL_EVSTAT0_OBSMUX1_M 0x00000400
#define AUX_EVCTL_EVSTAT0_OBSMUX1_S 10

// Field:     [9] OBSMUX0
//
// Observation input 0 from IOC.
// This event is configured by IOC:OBSAUXOUTPUT.SEL0 and can be overridden by
// IOC:OBSAUXOUTPUT.SEL_MISC.
#define AUX_EVCTL_EVSTAT0_OBSMUX0 0x00000200
#define AUX_EVCTL_EVSTAT0_OBSMUX0_BITN 9
#define AUX_EVCTL_EVSTAT0_OBSMUX0_M 0x00000200
#define AUX_EVCTL_EVSTAT0_OBSMUX0_S 9

// Field:     [8] ADC_FIFO_ALMOST_FULL
//
// AUX_ANAIF:ADCFIFOSTAT.ALMOST_FULL
#define AUX_EVCTL_EVSTAT0_ADC_FIFO_ALMOST_FULL 0x00000100
#define AUX_EVCTL_EVSTAT0_ADC_FIFO_ALMOST_FULL_BITN 8
#define AUX_EVCTL_EVSTAT0_ADC_FIFO_ALMOST_FULL_M 0x00000100
#define AUX_EVCTL_EVSTAT0_ADC_FIFO_ALMOST_FULL_S 8

// Field:     [7] ADC_DONE
//
// AUX_ANAIF ADC conversion done event.
#define AUX_EVCTL_EVSTAT0_ADC_DONE 0x00000080
#define AUX_EVCTL_EVSTAT0_ADC_DONE_BITN 7
#define AUX_EVCTL_EVSTAT0_ADC_DONE_M 0x00000080
#define AUX_EVCTL_EVSTAT0_ADC_DONE_S 7

// Field:     [6] SMPH_AUTOTAKE_DONE
//
// See AUX_SMPH:AUTOTAKE.SMPH_ID for description.
#define AUX_EVCTL_EVSTAT0_SMPH_AUTOTAKE_DONE 0x00000040
#define AUX_EVCTL_EVSTAT0_SMPH_AUTOTAKE_DONE_BITN 6
#define AUX_EVCTL_EVSTAT0_SMPH_AUTOTAKE_DONE_M 0x00000040
#define AUX_EVCTL_EVSTAT0_SMPH_AUTOTAKE_DONE_S 6

// Field:     [5] TIMER1_EV
//
// AUX_TIMER1_EV event, see AUX_TIMER:T1TARGET for description.
#define AUX_EVCTL_EVSTAT0_TIMER1_EV 0x00000020
#define AUX_EVCTL_EVSTAT0_TIMER1_EV_BITN 5
#define AUX_EVCTL_EVSTAT0_TIMER1_EV_M 0x00000020
#define AUX_EVCTL_EVSTAT0_TIMER1_EV_S 5

// Field:     [4] TIMER0_EV
//
// AUX_TIMER0_EV event, see AUX_TIMER:T0TARGET for description.
#define AUX_EVCTL_EVSTAT0_TIMER0_EV 0x00000010
#define AUX_EVCTL_EVSTAT0_TIMER0_EV_BITN 4
#define AUX_EVCTL_EVSTAT0_TIMER0_EV_M 0x00000010
#define AUX_EVCTL_EVSTAT0_TIMER0_EV_S 4

// Field:     [3] TDC_DONE
//
// AUX_TDC:STAT.DONE
#define AUX_EVCTL_EVSTAT0_TDC_DONE 0x00000008
#define AUX_EVCTL_EVSTAT0_TDC_DONE_BITN 3
#define AUX_EVCTL_EVSTAT0_TDC_DONE_M 0x00000008
#define AUX_EVCTL_EVSTAT0_TDC_DONE_S 3

// Field:     [2] AUX_COMPB
//
// Comparator B output
#define AUX_EVCTL_EVSTAT0_AUX_COMPB 0x00000004
#define AUX_EVCTL_EVSTAT0_AUX_COMPB_BITN 2
#define AUX_EVCTL_EVSTAT0_AUX_COMPB_M 0x00000004
#define AUX_EVCTL_EVSTAT0_AUX_COMPB_S 2

// Field:     [1] AUX_COMPA
//
// Comparator A output
#define AUX_EVCTL_EVSTAT0_AUX_COMPA 0x00000002
#define AUX_EVCTL_EVSTAT0_AUX_COMPA_BITN 1
#define AUX_EVCTL_EVSTAT0_AUX_COMPA_M 0x00000002
#define AUX_EVCTL_EVSTAT0_AUX_COMPA_S 1

