thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_aux_evctl.h
// Field:     [0] AON_RTC_CH2
//
// AON_RTC:EVFLAGS.CH2
#define AUX_EVCTL_EVSTAT0_AON_RTC_CH2 0x00000001
#define AUX_EVCTL_EVSTAT0_AON_RTC_CH2_BITN 0
#define AUX_EVCTL_EVSTAT0_AON_RTC_CH2_M 0x00000001
#define AUX_EVCTL_EVSTAT0_AON_RTC_CH2_S 0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVSTAT1
//
//*****************************************************************************
// Field:    [15] ADC_IRQ
//
// The logical function for this event is configurable.
//
// When DMACTL.EN = 1 :
//    Event = UDMA0 Channel 7 done event     OR
// AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW
//
// When DMACTL.EN = 0 :
//    Event = (NOT AUX_ANAIF:ADCFIFOSTAT.EMPTY)      OR
// AUX_ANAIF:ADCFIFOSTAT.OVERFLOW      OR      AUX_ANAIF:ADCFIFOSTAT.UNDERFLOW
//
// Bit 7 in UDMA0:DONEMASK must be 0.
#define AUX_EVCTL_EVSTAT1_ADC_IRQ 0x00008000
#define AUX_EVCTL_EVSTAT1_ADC_IRQ_BITN 15
#define AUX_EVCTL_EVSTAT1_ADC_IRQ_M 0x00008000
#define AUX_EVCTL_EVSTAT1_ADC_IRQ_S 15

// Field:    [14] MCU_EV
//
// Event from EVENT configured by EVENT:AUXSEL0.
#define AUX_EVCTL_EVSTAT1_MCU_EV 0x00004000
#define AUX_EVCTL_EVSTAT1_MCU_EV_BITN 14
#define AUX_EVCTL_EVSTAT1_MCU_EV_M 0x00004000
#define AUX_EVCTL_EVSTAT1_MCU_EV_S 14

// Field:    [13] ACLK_REF
//
// TDC reference clock.
// It is configured by DDI_0_OSC:CTL0.ACLK_REF_SRC_SEL and enabled by
// AUX_WUC:REFCLKCTL.REQ.
#define AUX_EVCTL_EVSTAT1_ACLK_REF 0x00002000
#define AUX_EVCTL_EVSTAT1_ACLK_REF_BITN 13
#define AUX_EVCTL_EVSTAT1_ACLK_REF_M 0x00002000
#define AUX_EVCTL_EVSTAT1_ACLK_REF_S 13

// Field:    [12] AUXIO15
//
// AUXIO15 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 7.
#define AUX_EVCTL_EVSTAT1_AUXIO15 0x00001000
#define AUX_EVCTL_EVSTAT1_AUXIO15_BITN 12
#define AUX_EVCTL_EVSTAT1_AUXIO15_M 0x00001000
#define AUX_EVCTL_EVSTAT1_AUXIO15_S 12

// Field:    [11] AUXIO14
//
// AUXIO14 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 6.
#define AUX_EVCTL_EVSTAT1_AUXIO14 0x00000800
#define AUX_EVCTL_EVSTAT1_AUXIO14_BITN 11
#define AUX_EVCTL_EVSTAT1_AUXIO14_M 0x00000800
#define AUX_EVCTL_EVSTAT1_AUXIO14_S 11

// Field:    [10] AUXIO13
//
// AUXIO13 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 5.
#define AUX_EVCTL_EVSTAT1_AUXIO13 0x00000400
#define AUX_EVCTL_EVSTAT1_AUXIO13_BITN 10
#define AUX_EVCTL_EVSTAT1_AUXIO13_M 0x00000400
#define AUX_EVCTL_EVSTAT1_AUXIO13_S 10

// Field:     [9] AUXIO12
//
// AUXIO12 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 4.
#define AUX_EVCTL_EVSTAT1_AUXIO12 0x00000200
#define AUX_EVCTL_EVSTAT1_AUXIO12_BITN 9
#define AUX_EVCTL_EVSTAT1_AUXIO12_M 0x00000200
#define AUX_EVCTL_EVSTAT1_AUXIO12_S 9

// Field:     [8] AUXIO11
//
// AUXIO11 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 3.
#define AUX_EVCTL_EVSTAT1_AUXIO11 0x00000100
#define AUX_EVCTL_EVSTAT1_AUXIO11_BITN 8
#define AUX_EVCTL_EVSTAT1_AUXIO11_M 0x00000100
#define AUX_EVCTL_EVSTAT1_AUXIO11_S 8

// Field:     [7] AUXIO10
//
// AUXIO10 pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 2.
#define AUX_EVCTL_EVSTAT1_AUXIO10 0x00000080
#define AUX_EVCTL_EVSTAT1_AUXIO10_BITN 7
#define AUX_EVCTL_EVSTAT1_AUXIO10_M 0x00000080
#define AUX_EVCTL_EVSTAT1_AUXIO10_S 7

// Field:     [6] AUXIO9
//
// AUXIO9   pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 1.
#define AUX_EVCTL_EVSTAT1_AUXIO9 0x00000040
#define AUX_EVCTL_EVSTAT1_AUXIO9_BITN 6
#define AUX_EVCTL_EVSTAT1_AUXIO9_M 0x00000040
#define AUX_EVCTL_EVSTAT1_AUXIO9_S 6

// Field:     [5] AUXIO8
//
// AUXIO8   pin level, read value corresponds to AUX_AIODIO1:GPIODIN bit 0.
#define AUX_EVCTL_EVSTAT1_AUXIO8 0x00000020
#define AUX_EVCTL_EVSTAT1_AUXIO8_BITN 5
#define AUX_EVCTL_EVSTAT1_AUXIO8_M 0x00000020
#define AUX_EVCTL_EVSTAT1_AUXIO8_S 5

// Field:     [4] AUXIO7
//
// AUXIO7   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 7.
#define AUX_EVCTL_EVSTAT1_AUXIO7 0x00000010
#define AUX_EVCTL_EVSTAT1_AUXIO7_BITN 4
#define AUX_EVCTL_EVSTAT1_AUXIO7_M 0x00000010
#define AUX_EVCTL_EVSTAT1_AUXIO7_S 4

// Field:     [3] AUXIO6
//
// AUXIO6   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 6.
#define AUX_EVCTL_EVSTAT1_AUXIO6 0x00000008
#define AUX_EVCTL_EVSTAT1_AUXIO6_BITN 3
#define AUX_EVCTL_EVSTAT1_AUXIO6_M 0x00000008
#define AUX_EVCTL_EVSTAT1_AUXIO6_S 3

// Field:     [2] AUXIO5
//
// AUXIO5   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 5.
#define AUX_EVCTL_EVSTAT1_AUXIO5 0x00000004
#define AUX_EVCTL_EVSTAT1_AUXIO5_BITN 2
#define AUX_EVCTL_EVSTAT1_AUXIO5_M 0x00000004
#define AUX_EVCTL_EVSTAT1_AUXIO5_S 2

// Field:     [1] AUXIO4
//
// AUXIO4   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 4.
#define AUX_EVCTL_EVSTAT1_AUXIO4 0x00000002
#define AUX_EVCTL_EVSTAT1_AUXIO4_BITN 1
#define AUX_EVCTL_EVSTAT1_AUXIO4_M 0x00000002
#define AUX_EVCTL_EVSTAT1_AUXIO4_S 1

// Field:     [0] AUXIO3
//
// AUXIO3   pin level, read value corresponds to AUX_AIODIO0:GPIODIN bit 3.
#define AUX_EVCTL_EVSTAT1_AUXIO3 0x00000001
#define AUX_EVCTL_EVSTAT1_AUXIO3_BITN 0
#define AUX_EVCTL_EVSTAT1_AUXIO3_M 0x00000001
#define AUX_EVCTL_EVSTAT1_AUXIO3_S 0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOMCUPOL
//
//*****************************************************************************
// Field:    [10] ADC_IRQ
//
// Select the event source level that sets EVTOMCUFLAGS.ADC_IRQ.
// ENUMs:
// LOW                      Low level
// HIGH                     High level
#define AUX_EVCTL_EVTOMCUPOL_ADC_IRQ 0x00000400
#define AUX_EVCTL_EVTOMCUPOL_ADC_IRQ_BITN 10
#define AUX_EVCTL_EVTOMCUPOL_ADC_IRQ_M 0x00000400
#define AUX_EVCTL_EVTOMCUPOL_ADC_IRQ_S 10
#define AUX_EVCTL_EVTOMCUPOL_ADC_IRQ_LOW 0x00000400
#define AUX_EVCTL_EVTOMCUPOL_ADC_IRQ_HIGH 0x00000000

