thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_aux_evctl.h
// Field:     [4] TIMER0_EV
//
// This event flag is set when level selected by EVTOMCUPOL.TIMER0_EV occurs on
// EVSTAT0.TIMER0_EV.
#define AUX_EVCTL_EVTOMCUFLAGS_TIMER0_EV 0x00000010
#define AUX_EVCTL_EVTOMCUFLAGS_TIMER0_EV_BITN 4
#define AUX_EVCTL_EVTOMCUFLAGS_TIMER0_EV_M 0x00000010
#define AUX_EVCTL_EVTOMCUFLAGS_TIMER0_EV_S 4

// Field:     [3] TDC_DONE
//
// This event flag is set when level selected by EVTOMCUPOL.TDC_DONE occurs on
// EVSTAT0.TDC_DONE.
#define AUX_EVCTL_EVTOMCUFLAGS_TDC_DONE 0x00000008
#define AUX_EVCTL_EVTOMCUFLAGS_TDC_DONE_BITN 3
#define AUX_EVCTL_EVTOMCUFLAGS_TDC_DONE_M 0x00000008
#define AUX_EVCTL_EVTOMCUFLAGS_TDC_DONE_S 3

// Field:     [2] AUX_COMPB
//
// This event flag is set when edge selected by EVTOMCUPOL.AUX_COMPB occurs on
// EVSTAT0.AUX_COMPB.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPB 0x00000004
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPB_BITN 2
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPB_M 0x00000004
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPB_S 2

// Field:     [1] AUX_COMPA
//
// This event flag is set when edge selected by EVTOMCUPOL.AUX_COMPA occurs on
// EVSTAT0.AUX_COMPA.
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPA 0x00000002
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPA_BITN 1
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPA_M 0x00000002
#define AUX_EVCTL_EVTOMCUFLAGS_AUX_COMPA_S 1

// Field:     [0] AON_WU_EV
//
// This event flag is set when level selected by EVTOMCUPOL.AON_WU_EV occurs on
// the reduction-OR of the AUX_EVCTL:EVSTAT0.RTC_CH2_EV,
// AUX_EVCTL:EVSTAT0.AON_SW, and AUX_EVCTL:EVSTAT0.AON_PROG_WU events.
#define AUX_EVCTL_EVTOMCUFLAGS_AON_WU_EV 0x00000001
#define AUX_EVCTL_EVTOMCUFLAGS_AON_WU_EV_BITN 0
#define AUX_EVCTL_EVTOMCUFLAGS_AON_WU_EV_M 0x00000001
#define AUX_EVCTL_EVTOMCUFLAGS_AON_WU_EV_S 0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_COMBEVTOMCUMASK
//
//*****************************************************************************
// Field:    [10] ADC_IRQ
//
// EVTOMCUFLAGS.ADC_IRQ contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_ADC_IRQ 0x00000400
#define AUX_EVCTL_COMBEVTOMCUMASK_ADC_IRQ_BITN 10
#define AUX_EVCTL_COMBEVTOMCUMASK_ADC_IRQ_M 0x00000400
#define AUX_EVCTL_COMBEVTOMCUMASK_ADC_IRQ_S 10

// Field:     [9] OBSMUX0
//
// EVTOMCUFLAGS.MCU_OBSMUX0 contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_OBSMUX0 0x00000200
#define AUX_EVCTL_COMBEVTOMCUMASK_OBSMUX0_BITN 9
#define AUX_EVCTL_COMBEVTOMCUMASK_OBSMUX0_M 0x00000200
#define AUX_EVCTL_COMBEVTOMCUMASK_OBSMUX0_S 9

// Field:     [8] ADC_FIFO_ALMOST_FULL
//
// EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_ADC_FIFO_ALMOST_FULL 0x00000100
#define AUX_EVCTL_COMBEVTOMCUMASK_ADC_FIFO_ALMOST_FULL_BITN 8
#define AUX_EVCTL_COMBEVTOMCUMASK_ADC_FIFO_ALMOST_FULL_M 0x00000100
#define AUX_EVCTL_COMBEVTOMCUMASK_ADC_FIFO_ALMOST_FULL_S 8

// Field:     [7] ADC_DONE
//
// EVTOMCUFLAGS.ADC_DONE contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_ADC_DONE 0x00000080
#define AUX_EVCTL_COMBEVTOMCUMASK_ADC_DONE_BITN 7
#define AUX_EVCTL_COMBEVTOMCUMASK_ADC_DONE_M 0x00000080
#define AUX_EVCTL_COMBEVTOMCUMASK_ADC_DONE_S 7

// Field:     [6] SMPH_AUTOTAKE_DONE
//
// EVTOMCUFLAGS.SMPH_AUTOTAKE_DONE contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_SMPH_AUTOTAKE_DONE 0x00000040
#define AUX_EVCTL_COMBEVTOMCUMASK_SMPH_AUTOTAKE_DONE_BITN 6
#define AUX_EVCTL_COMBEVTOMCUMASK_SMPH_AUTOTAKE_DONE_M 0x00000040
#define AUX_EVCTL_COMBEVTOMCUMASK_SMPH_AUTOTAKE_DONE_S 6

// Field:     [5] TIMER1_EV
//
// EVTOMCUFLAGS.TIMER1_EV contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_TIMER1_EV 0x00000020
#define AUX_EVCTL_COMBEVTOMCUMASK_TIMER1_EV_BITN 5
#define AUX_EVCTL_COMBEVTOMCUMASK_TIMER1_EV_M 0x00000020
#define AUX_EVCTL_COMBEVTOMCUMASK_TIMER1_EV_S 5

// Field:     [4] TIMER0_EV
//
// EVTOMCUFLAGS.TIMER0_EV contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_TIMER0_EV 0x00000010
#define AUX_EVCTL_COMBEVTOMCUMASK_TIMER0_EV_BITN 4
#define AUX_EVCTL_COMBEVTOMCUMASK_TIMER0_EV_M 0x00000010
#define AUX_EVCTL_COMBEVTOMCUMASK_TIMER0_EV_S 4

// Field:     [3] TDC_DONE
//
// EVTOMCUFLAGS.TDC_DONE contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_TDC_DONE 0x00000008
#define AUX_EVCTL_COMBEVTOMCUMASK_TDC_DONE_BITN 3
#define AUX_EVCTL_COMBEVTOMCUMASK_TDC_DONE_M 0x00000008
#define AUX_EVCTL_COMBEVTOMCUMASK_TDC_DONE_S 3

// Field:     [2] AUX_COMPB
//
// EVTOMCUFLAGS.AUX_COMPB contribution to the AUX_COMB event.
//
// 0: Exclude
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPB 0x00000004
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPB_BITN 2
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPB_M 0x00000004
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPB_S 2

// Field:     [1] AUX_COMPA
//
// EVTOMCUFLAGS.AUX_COMPA contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPA 0x00000002
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPA_BITN 1
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPA_M 0x00000002
#define AUX_EVCTL_COMBEVTOMCUMASK_AUX_COMPA_S 1

// Field:     [0] AON_WU_EV
//
// EVTOMCUFLAGS.AON_WU_EV contribution to the AUX_COMB event.
//
// 0: Exclude.
// 1: Include.
#define AUX_EVCTL_COMBEVTOMCUMASK_AON_WU_EV 0x00000001
#define AUX_EVCTL_COMBEVTOMCUMASK_AON_WU_EV_BITN 0
#define AUX_EVCTL_COMBEVTOMCUMASK_AON_WU_EV_M 0x00000001
#define AUX_EVCTL_COMBEVTOMCUMASK_AON_WU_EV_S 0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_VECFLAGS
//
//*****************************************************************************
// Field:     [3] VEC3
//
// Vector flag 3.
//
// The vector flag is set if the edge selected VECCFG1.VEC3_POL occurs on the
// event selected in VECCFG1.VEC3_EV.
//
// The flag is cleared by writing a 0 to this bit, or (preferably) a 1 to
// VECFLAGSCLR.VEC3.
#define AUX_EVCTL_VECFLAGS_VEC3 0x00000008
#define AUX_EVCTL_VECFLAGS_VEC3_BITN 3
#define AUX_EVCTL_VECFLAGS_VEC3_M 0x00000008
#define AUX_EVCTL_VECFLAGS_VEC3_S 3

// Field:     [2] VEC2
//
// Vector flag 2.
//
// The vector flag is set if the edge selected VECCFG1.VEC2_POL occurs on the
// event selected in VECCFG1.VEC2_EV.
//
// The flag is cleared by writing a 0 to this bit, or (preferably) a 1 to
// VECFLAGSCLR.VEC2.
#define AUX_EVCTL_VECFLAGS_VEC2 0x00000004
#define AUX_EVCTL_VECFLAGS_VEC2_BITN 2
#define AUX_EVCTL_VECFLAGS_VEC2_M 0x00000004
#define AUX_EVCTL_VECFLAGS_VEC2_S 2

// Field:     [1] VEC1
//
// Vector flag 1.
//
// The vector flag is set if the edge selected VECCFG0.VEC1_POL occurs on the
// event selected in VECCFG0.VEC1_EV.
//
// The flag is cleared by writing a 0 to this bit, or (preferably) a 1 to
// VECFLAGSCLR.VEC1.
#define AUX_EVCTL_VECFLAGS_VEC1 0x00000002
#define AUX_EVCTL_VECFLAGS_VEC1_BITN 1
#define AUX_EVCTL_VECFLAGS_VEC1_M 0x00000002
#define AUX_EVCTL_VECFLAGS_VEC1_S 1

// Field:     [0] VEC0
//
// Vector flag 0.
//
// The vector flag is set if the edge selected VECCFG0.VEC0_POL occurs on the
// event selected in VECCFG0.VEC0_EV.
//
// The flag is cleared by writing a 0 to this bit, or (preferably) a 1 to
// VECFLAGSCLR.VEC0.
#define AUX_EVCTL_VECFLAGS_VEC0 0x00000001
#define AUX_EVCTL_VECFLAGS_VEC0_BITN 0
#define AUX_EVCTL_VECFLAGS_VEC0_M 0x00000001
#define AUX_EVCTL_VECFLAGS_VEC0_S 0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOMCUFLAGSCLR
//
//*****************************************************************************
// Field:    [10] ADC_IRQ
//
// Write 1 to clear EVTOMCUFLAGS.ADC_IRQ.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_ADC_IRQ 0x00000400
#define AUX_EVCTL_EVTOMCUFLAGSCLR_ADC_IRQ_BITN 10
#define AUX_EVCTL_EVTOMCUFLAGSCLR_ADC_IRQ_M 0x00000400
#define AUX_EVCTL_EVTOMCUFLAGSCLR_ADC_IRQ_S 10

