thelsing/knx/examples/knx-cc1310/coresdk_cc13xx_cc26xx/source/ti/devices/cc13x0/inc/hw_aux_evctl.h
// Field:     [9] OBSMUX0
//
// Write 1 to clear EVTOMCUFLAGS.MCU_OBSMUX0.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_OBSMUX0 0x00000200
#define AUX_EVCTL_EVTOMCUFLAGSCLR_OBSMUX0_BITN 9
#define AUX_EVCTL_EVTOMCUFLAGSCLR_OBSMUX0_M 0x00000200
#define AUX_EVCTL_EVTOMCUFLAGSCLR_OBSMUX0_S 9

// Field:     [8] ADC_FIFO_ALMOST_FULL
//
// Write 1 to clear EVTOMCUFLAGS.ADC_FIFO_ALMOST_FULL.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_ADC_FIFO_ALMOST_FULL 0x00000100
#define AUX_EVCTL_EVTOMCUFLAGSCLR_ADC_FIFO_ALMOST_FULL_BITN 8
#define AUX_EVCTL_EVTOMCUFLAGSCLR_ADC_FIFO_ALMOST_FULL_M 0x00000100
#define AUX_EVCTL_EVTOMCUFLAGSCLR_ADC_FIFO_ALMOST_FULL_S 8

// Field:     [7] ADC_DONE
//
// Write 1 to clear EVTOMCUFLAGS.ADC_DONE.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_ADC_DONE 0x00000080
#define AUX_EVCTL_EVTOMCUFLAGSCLR_ADC_DONE_BITN 7
#define AUX_EVCTL_EVTOMCUFLAGSCLR_ADC_DONE_M 0x00000080
#define AUX_EVCTL_EVTOMCUFLAGSCLR_ADC_DONE_S 7

// Field:     [6] SMPH_AUTOTAKE_DONE
//
// Write 1 to clear EVTOMCUFLAGS.SMPH_AUTOTAKE_DONE.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_SMPH_AUTOTAKE_DONE 0x00000040
#define AUX_EVCTL_EVTOMCUFLAGSCLR_SMPH_AUTOTAKE_DONE_BITN 6
#define AUX_EVCTL_EVTOMCUFLAGSCLR_SMPH_AUTOTAKE_DONE_M 0x00000040
#define AUX_EVCTL_EVTOMCUFLAGSCLR_SMPH_AUTOTAKE_DONE_S 6

// Field:     [5] TIMER1_EV
//
// Write 1 to clear EVTOMCUFLAGS.TIMER1_EV.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_TIMER1_EV 0x00000020
#define AUX_EVCTL_EVTOMCUFLAGSCLR_TIMER1_EV_BITN 5
#define AUX_EVCTL_EVTOMCUFLAGSCLR_TIMER1_EV_M 0x00000020
#define AUX_EVCTL_EVTOMCUFLAGSCLR_TIMER1_EV_S 5

// Field:     [4] TIMER0_EV
//
// Write 1 to clear EVTOMCUFLAGS.TIMER0_EV.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_TIMER0_EV 0x00000010
#define AUX_EVCTL_EVTOMCUFLAGSCLR_TIMER0_EV_BITN 4
#define AUX_EVCTL_EVTOMCUFLAGSCLR_TIMER0_EV_M 0x00000010
#define AUX_EVCTL_EVTOMCUFLAGSCLR_TIMER0_EV_S 4

// Field:     [3] TDC_DONE
//
// Write 1 to clear EVTOMCUFLAGS.TDC_DONE.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_TDC_DONE 0x00000008
#define AUX_EVCTL_EVTOMCUFLAGSCLR_TDC_DONE_BITN 3
#define AUX_EVCTL_EVTOMCUFLAGSCLR_TDC_DONE_M 0x00000008
#define AUX_EVCTL_EVTOMCUFLAGSCLR_TDC_DONE_S 3

// Field:     [2] AUX_COMPB
//
// Write 1 to clear EVTOMCUFLAGS.AUX_COMPB.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPB 0x00000004
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPB_BITN 2
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPB_M 0x00000004
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPB_S 2

// Field:     [1] AUX_COMPA
//
// Write 1 to clear EVTOMCUFLAGS.AUX_COMPA.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPA 0x00000002
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPA_BITN 1
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPA_M 0x00000002
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AUX_COMPA_S 1

// Field:     [0] AON_WU_EV
//
// Write 1 to clear EVTOMCUFLAGS.AON_WU_EV.
//
// Read value is 0.
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AON_WU_EV 0x00000001
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AON_WU_EV_BITN 0
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AON_WU_EV_M 0x00000001
#define AUX_EVCTL_EVTOMCUFLAGSCLR_AON_WU_EV_S 0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_EVTOAONFLAGSCLR
//
//*****************************************************************************
// Field:     [8] TIMER1_EV
//
// Write 1 to clear EVTOAONFLAGS.TIMER1_EV.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_TIMER1_EV 0x00000100
#define AUX_EVCTL_EVTOAONFLAGSCLR_TIMER1_EV_BITN 8
#define AUX_EVCTL_EVTOAONFLAGSCLR_TIMER1_EV_M 0x00000100
#define AUX_EVCTL_EVTOAONFLAGSCLR_TIMER1_EV_S 8

// Field:     [7] TIMER0_EV
//
// Write 1 to clear EVTOAONFLAGS.TIMER0_EV.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_TIMER0_EV 0x00000080
#define AUX_EVCTL_EVTOAONFLAGSCLR_TIMER0_EV_BITN 7
#define AUX_EVCTL_EVTOAONFLAGSCLR_TIMER0_EV_M 0x00000080
#define AUX_EVCTL_EVTOAONFLAGSCLR_TIMER0_EV_S 7

// Field:     [6] TDC_DONE
//
// Write 1 to clear EVTOAONFLAGS.TDC_DONE.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_TDC_DONE 0x00000040
#define AUX_EVCTL_EVTOAONFLAGSCLR_TDC_DONE_BITN 6
#define AUX_EVCTL_EVTOAONFLAGSCLR_TDC_DONE_M 0x00000040
#define AUX_EVCTL_EVTOAONFLAGSCLR_TDC_DONE_S 6

// Field:     [5] ADC_DONE
//
// Write 1 to clear EVTOAONFLAGS.ADC_DONE.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_ADC_DONE 0x00000020
#define AUX_EVCTL_EVTOAONFLAGSCLR_ADC_DONE_BITN 5
#define AUX_EVCTL_EVTOAONFLAGSCLR_ADC_DONE_M 0x00000020
#define AUX_EVCTL_EVTOAONFLAGSCLR_ADC_DONE_S 5

// Field:     [4] AUX_COMPB
//
// Write 1 to clear EVTOAONFLAGS.AUX_COMPB.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPB 0x00000010
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPB_BITN 4
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPB_M 0x00000010
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPB_S 4

// Field:     [3] AUX_COMPA
//
// Write 1 to clear EVTOAONFLAGS.AUX_COMPA.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPA 0x00000008
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPA_BITN 3
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPA_M 0x00000008
#define AUX_EVCTL_EVTOAONFLAGSCLR_AUX_COMPA_S 3

// Field:     [2] SWEV2
//
// Write 1 to clear EVTOAONFLAGS.SWEV2.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV2 0x00000004
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV2_BITN 2
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV2_M 0x00000004
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV2_S 2

// Field:     [1] SWEV1
//
// Write 1 to clear EVTOAONFLAGS.SWEV1.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV1 0x00000002
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV1_BITN 1
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV1_M 0x00000002
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV1_S 1

// Field:     [0] SWEV0
//
// Write 1 to clear EVTOAONFLAGS.SWEV0.
//
// Read value is 0.
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV0 0x00000001
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV0_BITN 0
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV0_M 0x00000001
#define AUX_EVCTL_EVTOAONFLAGSCLR_SWEV0_S 0

//*****************************************************************************
//
// Register: AUX_EVCTL_O_VECFLAGSCLR
//
//*****************************************************************************
// Field:     [3] VEC3
//
// Clear vector flag 3.
//
// 0: No effect.
// 1: Clear VECFLAGS.VEC3.
//
// Read value is 0.
#define AUX_EVCTL_VECFLAGSCLR_VEC3 0x00000008
#define AUX_EVCTL_VECFLAGSCLR_VEC3_BITN 3
#define AUX_EVCTL_VECFLAGSCLR_VEC3_M 0x00000008
#define AUX_EVCTL_VECFLAGSCLR_VEC3_S 3

// Field:     [2] VEC2
//
// Clear vector flag 2.
//
// 0: No effect.
// 1: Clear VECFLAGS.VEC2.
//
// Read value is 0.
#define AUX_EVCTL_VECFLAGSCLR_VEC2 0x00000004
#define AUX_EVCTL_VECFLAGSCLR_VEC2_BITN 2
#define AUX_EVCTL_VECFLAGSCLR_VEC2_M 0x00000004
#define AUX_EVCTL_VECFLAGSCLR_VEC2_S 2

// Field:     [1] VEC1
//
// Clear vector flag 1.
//
// 0: No effect.
// 1: Clear VECFLAGS.VEC1.
//
// Read value is 0.
#define AUX_EVCTL_VECFLAGSCLR_VEC1 0x00000002
#define AUX_EVCTL_VECFLAGSCLR_VEC1_BITN 1
#define AUX_EVCTL_VECFLAGSCLR_VEC1_M 0x00000002
#define AUX_EVCTL_VECFLAGSCLR_VEC1_S 1

// Field:     [0] VEC0
//
// Clear vector flag 0.
//
// 0: No effect.
// 1: Clear VECFLAGS.VEC0.
//
// Read value is 0.
#define AUX_EVCTL_VECFLAGSCLR_VEC0 0x00000001
#define AUX_EVCTL_VECFLAGSCLR_VEC0_BITN 0
#define AUX_EVCTL_VECFLAGSCLR_VEC0_M 0x00000001
#define AUX_EVCTL_VECFLAGSCLR_VEC0_S 0

#endif // __AUX_EVCTL__
